<template>
  <div>
    <div class="items">
      <h3 class="intro-first">안녕하세요. 프론트 개발자 배찬영입니다.</h3>
      <p>
        대학교 졸업후 전공과 무관한 곳(반도체 장비 CS업무)에서 취직을 하고 일을
        하다가 이곳에서의 나의 미래가 보이지 않았습니다. 이 일로 나의 미래를
        맡기기엔 너무 아님을 깨닫고 전공을 다시 살려서 서울에 올라와 부트캠프를
        통해 개발자의 길로 전향하게 되었습니다. 부트캠프에서 백엔드 과정으로
        수료를 하고 처음 입사한 회사에서도 백엔드로 입사를 하였지만 하는 업무가
        일렉트론 개발을 진행하게 되었고, 일렉트론 특성상 node를 사용하지만
        프론트개발이 더욱 집중이 되었다보니 프론트 개발자로 경력을 쌓고
        있습니다. 추후에는 백엔드의 경헙도 있고, 프론트 엔드 개발 경험도
        있다보니 두 경험을 살려서 풀스택으로 성장하는 개발자가 되었으면
        좋겠습니다. 감사합니다.
      </p>
      <!-- <h3 class="intro-title">안녕하세요. 프론트 개발자 배찬영입니다.</h3>
      대학교 졸업후 전공과 무관한 곳(반도체 장비 CS업무)에서 취직을 하고 일을
      하다가 이곳에서의 나의 미래가 보이지 않았습니다. 이 일로 나의 미래를
      맡기기엔 너무 아님을 깨닫고 전공을 다시 살려서 서울에 올라와 부트캠프를
      통해 개발자의 길로 전향하게 되었습니다. 부트캠프에서 백엔드 과정으로
      수료를 하고 처음 입사한 회사에서도 백엔드로 입사를 하였지만 하는 업무가
      일렉트론 개발을 진행하게 되었고, 일렉트론 특성상 node를 사용하지만
      프론트개발이 더욱 집중이 되었다보니 프론트 개발자로 경력을 쌓고 있습니다.
      추후에는 백엔드의 경헙도 있고, 프론트 엔드 개발 경험도 있다보니 두 경험을
      살려서 풀스택으로 성장하는 개발자가 되었으면 좋겠습니다. 감사합니다. -->
    </div>
  </div>
</template>

<style scoped>
p {
  color: #2c3e50;
}
.intro-first {
  color: #2c3e50;
  border-bottom: solid 2px;
}
.intro-title {
  border-bottom: solid 2px;
  margin-top: 10px;
}
</style>
